## Домашнее задание к лекции "Библиотека Pandas"

### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [16]:
import pandas as pd

In [24]:
%%time
data = pd.read_csv('/Users/eugenesagalakov/Documents/GitHub/pyda7-hw9/rating.csv')
data.head()

CPU times: user 26.6 ms, sys: 12.1 ms, total: 38.7 ms
Wall time: 43.6 ms

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [26]:
data[data['rating'] == 5.0]['movieId'].value_counts().head(1)

318    153
Name: movieId, dtype: int64

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [27]:
data = pd.read_csv('power.csv')

In [28]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [29]:
# сначала выделяем страны в новый датафрейм
filt_countries = data[((data['country'] == 'Lithuania') | (data['country'] == 'Latvia') | (data['country'] == 'Estonia'))]
filt_countries['country'].unique()

array(['Lithuania', 'Latvia', 'Estonia'], dtype=object)

In [30]:
# потом выделяем категории
filt_c2 = filt_countries[((filt_countries['category'] == 4) | (filt_countries['category'] == 12) | (filt_countries['category'] == 21))]
filt_c2['category'].unique()

array([ 4, 12, 21])

In [31]:
# выбираем только период с 2005 по 2010, убираем отрицательные quantity, делаем итоговую группировку
filt_c2[(filt_c2['year'] > 2004) & (filt_c2['year'] < 2011) & (filt_c2['quantity'] > 0)][['country', 'quantity']].groupby(['country']).sum()

           quantity
country
Estonia     63440.0
Latvia      54844.0
Lithuania  122296.0

# Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [58]:
import pandas as pd

In [66]:
pd.read_html('https://fortrader.org/currencyrates',encoding='utf-8')

[    Код  Количество                 Название       RUB  Изменение
 0   USD           1               Доллар США   75.1107    -0.6186
 1   EUR           1                     Евро   89.8850    -1.0356
 2   CNY           1           Китайский юань   11.5919    -0.1246
 3   GBP           1          Фунт стерлингов  102.8941     0.0083
 4   TJS          10        Таджикский сомони   65.9155    -0.5429
 5   KZT         100      Казахстанский тенге   17.8754    -0.0767
 6   TRY           1            Турецкая лира   10.5924     0.0068
 7   PLN           1          Польский злотый   20.0087    -0.2144
 8   UAH          10        Украинская гривна   27.0535    -0.0799
 9   BYN           1        Белорусский рубль   28.5951    -0.1392
 10  UZS       10000            Узбекский сум   71.8076    -0.0388
 11  KGS         100           Киргизский сом   88.5508    -0.7285
 12  AMD         100           Армянский драм   14.4319    -0.1077
 13  JPY         100            Японская иена   71.2287    -0.7539
 14  CHF           1        Швейцарский франк   83.2067    -0.7970
 15  CZK          10            Чешская крона   34.8138    -0.2851
 16  CAD           1         Канадский доллар   58.7032    -0.5390
 17  AZN           1    Азербайджанский манат   44.2088    -0.3641
 18  KRW        1000     Вон Республики Корея   66.8292    -0.8899
 19  SEK          10           Шведская крона   88.8926    -0.9437
 20  INR          10          Индийская рупия   10.3024    -0.0838
 21  HUF         100        Венгерский форинт   25.3132    -0.2184
 22  NOK          10         Норвежская крона   87.1465    -0.8188
 23  AUD           1     Австралийский доллар   57.2193    -0.5773
 24  BGN           1           Болгарский лев   45.9983    -0.4500
 25  MDL          10           Молдавский лей   42.9818    -0.3540
 26  DKK           1            Датская крона   12.0975    -0.1159
 27  SGD           1      Сингапурский доллар   56.1491    -0.5727
 28  RON           1            Румынский лей   18.4506    -0.1900
 29  BRL           1         Бразильский реал   13.8402    -0.3050
 30  TMT           1  Новый туркменский манат   21.4909    -0.1770
 31  XDR           1                      СДР  107.6524    -1.0161
 32  ZAR          10     Южноафриканский рэнд   50.3136    -0.3012]

In [67]:
data_df = pd.read_html('https://fortrader.org/currencyrates', 
                        encoding='utf-8')[0]

In [68]:
data_df.head(7)

   Код  Количество             Название       RUB  Изменение
0  USD           1           Доллар США   75.1107    -0.6186
1  EUR           1                 Евро   89.8850    -1.0356
2  CNY           1       Китайский юань   11.5919    -0.1246
3  GBP           1      Фунт стерлингов  102.8941     0.0083
4  TJS          10    Таджикский сомони   65.9155    -0.5429
5  KZT         100  Казахстанский тенге   17.8754    -0.0767
6  TRY           1        Турецкая лира   10.5924     0.0068

In [69]:
type(data_df)

pandas.core.frame.DataFrame

In [70]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Код         33 non-null     object
 1   Количество  33 non-null     int64
 2   Название    33 non-null     object
 3   RUB         33 non-null     float64
 4   Изменение   33 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.4+ KB